[
    {
        "imageSrc": ["./images/About/1.jpg"],
        "Description": "About me",
        "Title": "Jeroen Roelant",
        "Content": "<p><a href='https://drive.google.com/file/d/1SRgdchUgugTepNq4MtywqhOrcZ0ckDxO/view?usp=drive_link'>Curriculum Vitae</a> <a href='https://github.com/Jeroen-Roelant'>GitHub</a> <a href='https://www.linkedin.com/in/jeroen-roelant/'>LinkedIn</a></p>        <p>Al sinds jongs af aan was ik gefascineerd door technologie en het ontwerp er van. Dat zie je ook aan het academisch pad dat ik heb afgelegd. Na enkele jaren door te brengen in Humane wetenschappen, had ik door dat dat helemaal niet voor mij was. Toen ben ik overgeschakeld naar Multimedia op TSM. Dit is een richting die me veel beter lag.</p>  <p>In 2020 ben ik begonnen aan mijn opleiding Elektronica-ICT, aan de AP Hogeschool te Antwerpen, een opleiding dat me enorm veel heeft bijgeleerd. Hier heb ik een zeer technische mindset verworven, en geleerd om dat om te zetten naar echte digitale producten. Buiten dat heb ik ook enorm veel geleerd van analyse</p>   <p>Na mijn opleiding Elektornica-ICT heb ik besloten om nog een jaartje extra te studeren bij Thomas More in de richting Digital Experience Design, in het verkorte traject. Hier heb ik mijn design-skills verfijnd en deze ook beter leren toepassen op code.</p>                                 <h2>Skills</h2>     <p>Ik heb sinds ik begonnen ben al met veel verschillende technologieën gewerkt in verschillende contexten. Enkelen hiervan zijn: </p> <div class='horizontalList'>                                             <ul><h3>.NET</h3><li>EF-Core</li><li>ASP</li><li>MVC</li></ul>      <ul><h3>Java</h3><li>Spring boot</li><li>JPA</li><li>Hibernate</li></ul>    <ul><h3>Mobile</h3><li>Flutter</li><li>Kotlin</li><li>Ionic</li></ul>   <ul><h3>Web/JS</h3><li>Angular</li><li>React</li><li>JS/TS</li></ul>       <ul><h3>Andere</h3><li>Adobe</li><li>Linux</li><li>Figma</li></ul></div>        <p>En nog veel meer!</p>                                            <h2>Opleidingen</h2>                                                    <div class='experience'><h3>Thomas More Hogeschool Mechelen</h3> <p class='noMargin'>Digital Experience design | 2023 - 2024</p> <p class='noMargin'>Bachelor | Verkort traject</p></div><div class='experience'> <h3>AP Hogeschool Antwerpen</h3> <p class='noMargin'>Elektronica-ICT | 2020 - 2023</p> <p class='noMargin'>Professionele bachelor</p></div><div class='experience'> <h3>Universitat Politècnica de València</h3> <p class='noMargin'>Mobile development | 2022</p> <p class='noMargin'>Certificate | ICT Week 2022 (Winner!)</p></div><div class='experience'> <h3>Technische Scholen Mechelen</h3> <p class='noMargin'>Multimedia | 2018 - 2020</p> <p class='noMargin'>Secundair diploma | TSO</p></div> <h2>Vrijwilligerswerk</h2> <div class='experience'> <h3>VZW Elegast</h3> <p class='noMargin'>Digi-donderdag | 2023</p></div><h2>Hobby's & Interesses</h2><p>Ik hou me vaak op verschillende manieren bezig. Zo ben ik aan het leren om bas te spelen, en vind je me ook vaak terug in de fitness. Als het weertje beter is, dan kan je misschien wel tegen komen in de bossen, aan het wandelen.</p> <p>Verder speel ik af en toe ook wel eens een game of kijk ik eens een film of serie.</p>"
    },
    {
        "imageSrc": ["./images/WijzeWeetjes/1.png", "./images/WijzeWeetjes/2.gif", "./images/WijzeWeetjes/3.png"],
        "Description": "Design 5",
        "Title": "Wijze Weetjes",
        "Content": "<div class='techStack'><img src='./images/techStack/spline.jpg' alt='spline'></div>"
    },
    {
        "imageSrc": ["./images/GrowLab/1.png"],
        "Description": "Lab 3",
        "Title": "GrowLab",
        "Content": "<div class='techStack'><img src='./images/techStack/ts.jpg' alt='ts'><img src='./images/techStack/react.jpg' alt='react'><img src='./images/techStack/nest.jpg' alt='nest'><img src='./images/techStack/figma.jpg' alt='figma'></div>"
    },
    {
        "imageSrc": ["./images/Hoppin/Hoppin1.png", "./images/Hoppin/Hoppin_analysis_1.png", "./images/Hoppin/Hoppin_Analysis_2.png", "./images/Hoppin/Hoppin_Analysis_3.png"],
        "Description": "Design 3",
        "Title": "Hoppin",
        "Content": "<div class='techStack'><img src='./images/techStack/figma.jpg' alt='figma'></div><p>Voor deze opdracht kregen we de opgave om de mobiele applicatie van Hoppin, het platform voor het nieuwe vlaamse mobiliteitsplan, te redesignen. Dit met de bedoeling van een applicatie te maken die op een esthetische manier de gebruiker informatie geeft over zijn/haar ritten, tickets, lijnen, ...</p><p>Dit was mijn eerste grote opdracht in Figma, en gaf me dus direct een uitgebreide opdracht om Figma echt onder te knie te krijgen. Andere belangrijke dingen waren onder andere het analyseren van gebruikersnoden en deze omzetten naar user stories; het opvolgen van een designsysteem, standaarden en huisstijl, alsook de CRAP-regels en Nielsen Heuristics.</p><h2>Proces</h2><h3>Analyse</h3><p>De eerste stap was om de noden van de gebruikers te analyseren. Hiervoor hebben we in groep samen gezeten over verschillende sprints, en telkens geïtereerd om van een chaotische mess van <a href='./images/Hoppin/Hoppin_analysis_1.png'>functies</a>, naar <a href='./images/Hoppin/Hoppin_analysis_2.png'>User stories</a>, naar <a href='./images/Hoppin/Hoppin_analysis_3.png'>gestructureerde flowcharts</a> te gaan.</p><h3>Prototype</h3><p>    Na de analysefase was het tijd om een prototype te maken. Vanaf nu was het project individueel. Ook dit gebeurde op een iteratieve wijze. Ik begon met mijn wireframes, waarna ik een low-fidelity prototype maakte. Dit prototype werd dan getest met enkele gebruikers, en op basis van hun feedback werd het prototype aangepast. Dit proces werd herhaald tot ik een high-fidelity prototype had.</p><p>    Het high-fidelity prototype werd ook voleldig klikbaar gemaakt, zodat het leek alsof het een echte applicatie was. Dit prototype werd dan ook getest met gebruikers, en op basis van hun feedback werd het prototype aangepast, en grondig getest op fouten.</p><p>Het high-fidelity prototype kan je <a href='https://www.figma.com/proto/qDeByxqVmz1KJjjsNObI4T/%5BJeroen-Roelant%5D-HOPPIN-High-fidelity-prototype?page-id=0%3A1&node-id=46-11571&viewport=442%2C526%2C0.07&t=bGuVHFPIcKRQC0RR-1&scaling=scale-down&starting-point-node-id=46%3A11290&show-proto-sidebar=1'>hier</a> testen. (aanmelden doe je door gewoon op het emailveld en wachtwoordveld te klikken!)</p> <h2>User tests</h2> <p>Om het gemaakte prototype te testen en valideren, werden er ook verschillende testen uitgevoerd op de doelgroep. Dit via een 5 second test, een recognition test en user flow tests. Het verslag hiervan kan je <a href=''>hier</a> lezen.</p><h2>Lessons learned</h2> <p>De belangrijkste lessen die ik heb geleerd uit Hoppin, is hoe ik juist moet omgaan met een designproces. Ik heb geleerd hoe ik moet omgaan met gebruikers, hoe ik moet omgaan met feedback, en hoe ik moet omgaan met een designsysteem.</p> <p>Verder heb ik ook geleerd hoe ik moet omgaan met Figma. Na dit project voelde ik me een echte Figma power-user en klikte alles.</p>"
    },
    {
        "imageSrc": ["./images/ZenGarden/ZenGarden1.jpg", "./images/ZenGarden/Moodboard.jpg", "./images/ZenGarden/ZenGarden_proto_1.jpg", "./images/ZenGarden/ZenGarden_proto_2.jpg"],
        "Description": "Design 4",
        "Title": "CSS Zen Garden",
        "Content": "<div class='techStack'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/figma.jpg' alt='figma'></div><p>Voor het vak Design 4 kregen we de opdracht zelf de CSS Zen garden opdracht eens aan te pakken. Dit moesten we doen in thema van een architectuurstijl die ons willekeurig werd toegewezen. Ik kreeg als thema Art Nouveau.</p> <p>In het verleden had ik dit al eens gedaan (in het middelbaar), maar deze versie was ook niet super in haar resultaat. Daarom ben ik helemaal opnieuw begonnen om iets te maken dat past bij de stijl, en zeer esthetisch is.</p> <h2>Research & Moodboard</h2><p>Als eerst werd er grondig geresearched naar de historie van de stijl en de belangrijkste en bekendste artiesten, architecten en kunstwerken ervan. Belangrijke dingen die werden genoteerd, waren: Kleuren, stijlkenmerken, typografie, patronen, texturen, architecten, kunst(enaars), ...</p><p>Op basis van deze informatie werd er vervolgens een moodboard opgesteld. Dit is de tweede afbeelding in deze collectie. Dit is de basis waarop ik m'n design ging baseren.</p><h2>Prototype</h2><p>Het eerste wat ik besliste om mee verder op te bouwen, was om de site horizontaal te laten scrollen, in de plaats van verticaal, met een scroll snap. Waarom? dat weet ik niet maar het leek me een leuke manier om mijn ontwerp te laten differentiëren. Met dit idee ben ik dus vertrokken om een low-fidelity prototype te maken dat met elk onderwerp van de Zen Garden content een ander creatief ontwerp of idee probeerde te bereiken (zie <a href='./images/ZenGarden/ZenGarden_proto_1.jpg'>afbeelding 3</a>).</p><p>Dit werd later verfijnd tot een high-fidelity prototype, waarin er een keuze werd gemaakt naar kleuren, typografie, afbeeldingen, ... (zie <a href='./images/ZenGarden/ZenGarden_proto_2.jpg'>afbeelding 4</a>).</p><h2>Code</h2><p>Na het prototype werd de css uitgeschreven. Bekijk hier <a href='https://jeroen-roelant.github.io/Design4/ZenGarden/index.html'>het resultaat</a> en <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/ZenGarden/style.css'>de broncode</a>.</p><h2>Lessons learned</h2> <p>De belangrijkste lessen die ik heb geleerd uit Zen Garden, is uiteraard de werkwijze en hoe ik juist om ga met CSS. Dat is uiteindelijk ook het doel van de opdracht. Ik voel nu van mezelf dat ik beter om kan gaan met CSS, en leukere designs er in kan verwerken.</p>"
    },
    {
        "imageSrc": ["./images/Poster/1.gif", "./images/Poster/moodboard1.jpg", "./images/Poster/schetsen1.jpg"],
        "Description": "Design 4",
        "Title": "Dynamic Movie Poster",
        "Content": "<div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'></div><p>Hier kregen we de opdracht om een dynamische poster te maken, met enkel en alleen één HTML bestand. Alles qua styling en scripting moest dus ook in dit bestand gebeuren, alsook de SVGs die hier in moesten staan. Dit zorgde er voor dat ik heel creatief moest om gaan met de aanpak van dit project.</p>        <p>Het belangrijkste van deze opdracht was vooral dat structureel werken met de HTML, en speciale dingen leren doen met CSS (interacties en animaties).</p>        <p>Ik koos als thema de film Interstellar</p>         <h2>Research & Moodboard</h2>        <p>Veel research moest ik niet echt doen, aangezien Interstellar een van mijn favoriete films is en Christopher Nolan een van mijn favoriete regisseurs. Het doel van de research was dus om een duidelijke visuele stijl te kiezen, alsook een object waarop ik me wou baseren en gebruiken als centraal thema van mijn poster.</p>        <p>Op basis van de research die ik heb gedaan, heb ik vervolgens een <a href='./images/Poster/moodboard1.jpg'>moodboard</a> gemaakt. Dit moodboard omvat de visuele stijl en belangrijke onderdelen van de film die ik mogelijk in mijn poster wou verwerken. </p>           <h2>Ontwerp</h2>        <p>Op basis van het moodboard werden er enkele schetsen gemaakt (zie <a href='./images/Poster/schetsen1.jpg'>Afbeelding 3</a>) uiteindelijk koos ik om ontwerp 1 uit te werken.</p>      <p>Daarom heb ik ervoor gekozen om de Endurance, het ruimteschip uit de film, te gebruiken als centraal thema van mijn poster. Dit ruimteschip is een van de belangrijkste elementen van de film en is ook een heel herkenbaar object. Ik heb ervoor gekozen om de Endurance in de ruimte te plaatsen, met in het groot Gargantua, het zwarte gat, ook in beeld. Deze zijn beide geanimeerd, met het schip dat rond haar eigen as draait, en het zwarte gat dat een frame by frame animatie gebruikt.</p>       <h2>Uitwerking</h2>         <p>Ik heb ervoor gekozen om de poster in verschillende delen op te splitsen, en deze dan te animeren met CSS. Zo heb ik de Endurance en Gargantua in aparte divs geplaatst, en deze dan geanimeerd met CSS. De Endurance draait rond haar eigen as, en Gargantua heeft een frame by frame animatie die het zwarte gat laat draaien.</p>     <p>Voor deze frame by frame animatie heb ik vrij speciale code moeten ontwikkelen. Eerst had ik verschillende SVG's gemaakt, en deze vervolgens allemaal in de html geplaatst. Deze werden vervolgens gepositioneerd over elkaar. Een CSS animatie zorgt er voor dat de frames om de beurt worden getoond.</p>      <p>De sterren op de achtergrond krijgen een automatisch gegenereerde positie en grootte. Deze zijn dus altijd op een andere locatie op het scherm.</p>      <h2>Code</h2>      <p>Zie hier de <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/Poster/index.html'>broncode</a> en het <a href='https://jeroen-roelant.github.io/Design4/Poster/index.html'>resultaat</a>.</p> <h2>Lessons learned</h2> <p>Nog nooit heb ik zo'n creatieve HTML en CSS geschreven. Ik heb voor dit project echt out of the box moeten denken, en op bepaalde manieren te werk moeten gaan dat ik eerder niet heb gedaan.</p>"
    },
    {
        "imageSrc": ["./images/WordAnimation/1.gif", "./images/WordAnimation/2.gif", "./images/UselessWeb/1.gif", "./images/UselessWeb/2.gif"],
        "Description": "Design 4",
        "Title": "HTML/CSS projectjes",
        "Content": "<div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'></div><h2>Word animations</h2><p>We kregen enkele willekeurige woorden waarvan we een animatietje moesten maken, met CSS. Dit zijn de resultaten er van!</p> <p>Bekijk hier de <a href='https://jeroen-roelant.github.io/Design4/WordAnimation/Jazz_animation/index.html'>Jazz animatie</a> en de <a href='https://jeroen-roelant.github.io/Design4/WordAnimation/computer_animation/index.html'>Computer animatie</a>, of hier de <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/WordAnimation/Jazz_animation/styles.css'>Jazz broncode</a> en de <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/WordAnimation/computer_animation/styles.css'>Computer broncode</a>.</p> <h2>Useless web</h2> <p>Hier was de opdracht om gewoon enkele nutteloze websites te maken. Ik heb er voor gekozen om een calculator te maken die altijd wel juist antwoord, maar een antwoord geeft waar je niets mee bent een een left-on-red simulator die nooit antwoord op je berichtjes.</p><p>Probeer de <a href='https://jeroen-roelant.github.io/Design4/UselessWeb/Technically_correct_calculator/calculator.html'>Calculator</a> en <a href='https://jeroen-roelant.github.io/Design4/UselessWeb/LeftOnReadSim/index.html'>Left on read simulator</a>, of bekijk hier de <a href='https://github.com/Jeroen-Roelant/Design4/tree/main/UselessWeb/Technically_correct_calculator'>calculator broncode</a> of de <a href='https://github.com/Jeroen-Roelant/Design4/tree/main/UselessWeb/LeftOnReadSim'>left on read simulator broncode</a>.</p><h2>Lessons learned</h2><p>Aangezien ik nog niet wist hoe CSS animations werkte, was dit een leuke eerste introductie.</p>"
    }
]