[
  {
    "segment": ".experience-list",
    "imageSrc": [
      "./images/aigust/aigust_1.png",
      "./images/aigust/aigust_2.png",
      "./images/aigust/aigust_3.png"
    ],
    "Description": "Experience 11/2024 - ...",
    "Title": "aiGust",
    "Content": "<div class='tags'><p>Job</p><p>Fullstack</p><p>Web dev</p></div><div class='techStack'><img src='./images/techStack/vue.jpg' alt='vue'><img src='./images/techStack/python.png' alt='python'><img src='./images/techStack/fastapi.jpg' alt='fastapi'></div><p>Since November 2024, I have been working as a full-stack software engineer at the fintech startup aiGust in Leuven. In this environment, I am learning a lot. I am constantly given very interesting tasks that challenge me to work creatively but also critically.</p><p>Since aiGust is a startup, there is also a strong go-getter dynamic here. I get a lot of ownership over the features I develop, which makes me feel that in a short time, as a junior developer, I have learned a lot about the technologies we use as well as the financial sector we are active in.</p><p>Furthermore, there is also a very pleasant working atmosphere here, which, together with my very talented colleagues, results in a continuous stream of valuable feedback that I receive. This is very educational and helps me to keep improving.</p><p>Within the product itself, I have already had many opportunities to develop features and experiment with ideas I have. Due to the sector, many of these features are of course based on the large amounts of data we have. This data naturally needs to be visualized in different ways, and this is something I have been very involved with so far. I have also worked on other management and visualization features.</p><p>I was able to integrate into the team very quickly, and I can now work smoothly with the frameworks, designs, and codebase.</p><p>In short, this is a very interesting workplace where I see myself working for quite some time!</p>"
  },
  {
    "segment": ".project-list",
    "imageSrc": [
      "./images/Hoppin/Hoppin1.png",
      "./images/Hoppin/Hoppin_analysis_1.png",
      "./images/Hoppin/Hoppin_analysis_2.png",
      "./images/Hoppin/Hoppin_analysis_3.png"
    ],
    "Description": "App UIUX design",
    "Title": "Hoppin: app redesign",
    "Content": "<div class='tags'><p>Mobile</p><p>Thomas More</p></div><div class='techStack'><img src='./images/techStack/figma.jpg' alt='figma'><img src='./images/techStack/useberry.png' alt='useberry'><img src='./images/techStack/lyssna.png' alt='figma'></div><p>Watch the <a href='https://youtu.be/TePN5zIoEhM'>video walkthrough</a>!</p><p>For this assignment, we were tasked with redesigning the mobile application of Hoppin, the platform for the new Flemish mobility plan. The goal was to create an application that aesthetically provides the user with information about their trips, tickets, lines, etc.</p><p>This was my first major assignment in Figma, which immediately gave me an extensive project to really master Figma. Other important aspects included analyzing user needs and translating them into user stories; following a design system, standards, and house style, as well as the CRAP rules and Nielsen Heuristics.</p><h2>Process</h2><h3>Analysis</h3><p>The first step was to analyze the needs of the users. For this, we met in groups over several sprints, iterating each time to go from a chaotic mess of <a href='./images/Hoppin/Hoppin_analysis_1.png'>functions</a>, to <a href='./images/Hoppin/Hoppin_analysis_2.png'>user stories</a>, to <a href='./images/Hoppin/Hoppin_analysis_3.png'>structured flowcharts</a>.</p><h3>Prototype</h3><p>After the analysis phase, it was time to create a prototype. From this point, the project became individual. This was also done iteratively. I started with my wireframes, then made a low-fidelity prototype. This prototype was tested with several users, and based on their feedback, the prototype was adjusted. This process was repeated until I had a high-fidelity prototype.</p><p>The high-fidelity prototype was also made fully clickable, so it felt like a real application. This prototype was also tested with users, and based on their feedback, it was adjusted and thoroughly tested for errors.</p><p>You can test the high-fidelity prototype <a href='https://www.figma.com/proto/qDeByxqVmz1KJjjsNObI4T/%5BJeroen-Roelant%5D-HOPPIN-High-fidelity-prototype?page-id=0%3A1&node-id=46-11571&viewport=442%2C526%2C0.07&t=bGuVHFPIcKRQC0RR-1&scaling=scale-down&starting-point-node-id=46%3A11290&show-proto-sidebar=1'>here</a>. (to log in, just click on the email and password fields!)</p><h2>User tests</h2><p>To test and validate the created prototype, various tests were also conducted on the target group. This included a 5 second test, a recognition test, and user flow tests. The report can be read <a href='https://drive.google.com/file/d/1W7sl5_VDf9yX6g-q7IT4VdALMhGsEqy9/view?usp=sharing'>here</a>.</p><h2>Lessons learned</h2><p>The most important lessons I learned from Hoppin are how to properly handle a design process. I learned how to deal with users, how to handle feedback, and how to work with a design system.</p><p>Furthermore, I also learned how to use Figma. After this project, I felt like a real Figma power-user and clicked everything.</p>"
  },
  {
    "segment": ".misc-list",
    "imageSrc": [
      "./images/ZenGarden/ZenGarden1.jpg",
      "./images/ZenGarden/Moodboard.jpg",
      "./images/ZenGarden/ZenGarden_proto_1.jpg",
      "./images/ZenGarden/ZenGarden_proto_2.jpg"
    ],
    "Description": "Webdesign",
    "Title": "CSS Zen Garden",
    "Content": "<div class='tags'><p>Responsive web</p><p>Thomas More</p></div><div class='techStack'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/figma.jpg' alt='figma'></div><p>For the course Design 4, we were given the assignment to tackle the CSS Zen Garden project ourselves. We had to do this in the theme of an architectural style that was randomly assigned to us. I got Art Nouveau as my theme.</p> <p>In the past, I had already done this once (in high school), but that version was not great in its result. That's why I started completely from scratch to make something that fits the style and is very aesthetic.</p> <h2>Research & Moodboard</h2><p>First, I thoroughly researched the history of the style and the most important and well-known artists, architects, and artworks. Important things that were noted were: colors, style characteristics, typography, patterns, textures, architects, art(ists), ...</p><p>Based on this information, a moodboard was then created. This is the second image in this collection. This is the basis on which I based my design.</p><h2>Prototype</h2><p>The first thing I decided to build on was to make the site scroll horizontally instead of vertically, with scroll snap. Why? I don't know, but it seemed like a fun way to differentiate my design. With this idea, I started making a low-fidelity prototype that tried to achieve a different creative design or idea with each subject of the Zen Garden content (see <a href='./images/ZenGarden/ZenGarden_proto_1.jpg'>image 3</a>).</p> <img src='./images/ZenGarden/ZenGarden_proto_1.jpg' alt='low-fidelity prototype'><p>This was later refined into a high-fidelity prototype, in which choices were made for colors, typography, images, ... (see <a href='./images/ZenGarden/ZenGarden_proto_2.jpg'>image 4</a>).</p> <img src='./images/ZenGarden/ZenGarden_proto_2.jpg' alt='high fidelity prototype'><h2>Code</h2><p>After the prototype, the CSS was written. See <a href='https://jeroen-roelant.github.io/Design4/ZenGarden/index.html'>the result</a> and <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/ZenGarden/style.css'>the source code</a>.</p><h2>Lessons learned</h2> <p>The most important lessons I learned from Zen Garden are, of course, the workflow and how I work with CSS. That is ultimately the goal of the assignment. I now feel that I can work better with CSS and incorporate more fun designs into it.</p>"
  },
  {
    "segment": ".misc-list",
    "imageSrc": [
      "./images/Poster/1.gif",
      "./images/Poster/moodboard1.jpg",
      "./images/Poster/schetsen1.jpg"
    ],
    "Description": "Creative CSS design",
    "Title": "Dynamic Movie Poster",
    "Content": "<div class='tags'><p>Web</p><p>Thomas More</p></div><div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'></div><p>For this assignment, we were tasked with creating a dynamic poster using only a single HTML file. All styling and scripting, as well as the SVGs, had to be included in this file. This required a very creative approach to tackle the project.</p>        <p>The main focus of this assignment was to work structurally with HTML and learn to do special things with CSS (interactions and animations).</p>        <p>I chose the movie Interstellar as my theme.</p>         <h2>Research & Moodboard</h2>        <p>I didn't need to do much research since Interstellar is one of my favorite movies, and Christopher Nolan is one of my favorite directors. The goal of the research was to choose a clear visual style and an object to base the poster on and use as its central theme.</p>        <p>Based on the research I conducted, I created a <a href='./images/Poster/moodboard1.jpg'>moodboard</a>. This moodboard encompasses the visual style and key elements of the movie that I wanted to incorporate into my poster.</p>           <h2>Design</h2>        <p>Based on the moodboard, I made several sketches (see <a href='./images/Poster/schetsen1.jpg'>Image 3</a>). Ultimately, I chose to develop design 1.</p>      <p>I decided to use the Endurance, the spaceship from the movie, as the central theme of my poster. This spaceship is one of the most important elements of the movie and is also a very recognizable object. I chose to place the Endurance in space, with Gargantua, the black hole, prominently in the background. Both are animated, with the ship rotating on its axis and the black hole featuring a frame-by-frame animation.</p>       <h2>Implementation</h2>         <p>I decided to split the poster into different sections and animate them using CSS. For example, I placed the Endurance and Gargantua in separate divs and animated them with CSS. The Endurance rotates on its axis, and Gargantua has a frame-by-frame animation that makes the black hole spin.</p>     <p>For the frame-by-frame animation, I had to develop some unique code. First, I created several SVGs and placed them all in the HTML. These were then positioned on top of each other. A CSS animation ensures that the frames are displayed one by one.</p>      <p>The stars in the background are automatically generated with random positions and sizes. They are always in different locations on the screen.</p>      <h2>Code</h2>      <p>See the <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/Poster/index.html'>source code</a> and the <a href='https://jeroen-roelant.github.io/Design4/Poster/index.html'>result</a>.</p> <h2>Lessons learned</h2> <p>I have never written such creative HTML and CSS before. For this project, I really had to think outside the box and work in ways I hadn't tried before.</p>"
  },
  {
    "segment": ".misc-list",
    "imageSrc": [
      "./images/UselessWeb/1.gif",
      "./images/UselessWeb/2.gif"
    ],
    "Description": "Creative design & development",
    "Title": "Useless web projects",
    "Content": "<div class='tags'><p>Web</p><p>Thomas More</p></div><div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'></div><p>The assignment here was to create a few useless websites. I chose to make a calculator that always gives a correct answer, but one that is completely useless. The second project I made was a left-on-read simulator that never replies to your messages.</p><p>Overall, there wasn't a lot of design process involved in these assignments, as the ideas were based on existing interfaces or items. Some of these projects were part of group work.</p><h2>Technically correct calculator</h2><p>Programming a calculator turns out to be more difficult than initially thought. I had to put quite a bit of work into ensuring it works as you would expect from a calculator. However, it has a small twist. The answers you get 'make sense,' but they are completely useless. The answers will always be greater than, less than, or approximately, with a certain margin of randomized numbers.</p><p>Try the <a href='https://jeroen-roelant.github.io/Design4/UselessWeb/Technically_correct_calculator/calculator.html'>Calculator</a> and check out the <a href='https://github.com/Jeroen-Roelant/Design4/tree/main/UselessWeb/Technically_correct_calculator'>calculator source code</a>.</p><h2>Left on Read Simulator</h2><p>For my second useless web submission, I created a left-on-read chat simulator. This is a simple chat app clone where you can send messages, but it will never reply.</p><p>Try the <a href='https://jeroen-roelant.github.io/Design4/UselessWeb/LeftOnReadSim/index.html'>Left on Read Simulator</a> and check out the <a href='https://github.com/Jeroen-Roelant/Design4/tree/main/UselessWeb/LeftOnReadSim'>left-on-read simulator source code</a>.</p><h2>Lessons learned</h2><p>It was mainly a fun project to refresh my CSS skills, and I also discovered that programming a calculator is a bit more complex than you might expect.</p>"
  },
  {
    "segment": ".misc-list",
    "imageSrc": [
      "./images/WordAnimation/1.gif",
      "./images/WordAnimation/2.gif"
    ],
    "Description": "CSS Design & Animation",
    "Title": "CSS Word Animations",
    "Content": "<div class='tags'><p>Web</p><p>Thomas More</p></div><div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'></div><p>We were given a few random words for which we had to create small animations using CSS. These are the results!</p> <h2>Jazz</h2> <p>As a jazz fan, I was very happy to receive this word. I immediately had an idea to work on. First, I made some sketches, which unfortunately have been lost over time. However, they were a good starting point to build upon.</p> <p>While working on the animations, I found it a bit too simple, so I added a few extra elements, such as a shape in the background and some musical notes, as well as a bit of color. I thought carefully about the colors because I wanted to use authentic jazz colors.</p> <p>Check out the <a href='https://jeroen-roelant.github.io/Design4/WordAnimation/Jazz_animation/index.html'>Jazz animation</a> and the <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/WordAnimation/Jazz_animation/styles.css'>Jazz source code</a>.</p><h2>Computer</h2> <p>The computer idea was even simpler. Originally, it came from my friend Tim.</p> <p>Check out the <a href='https://jeroen-roelant.github.io/Design4/WordAnimation/Jazz_animation/index.html'>Jazz animation</a> and the <a href='https://jeroen-roelant.github.io/Design4/WordAnimation/computer_animation/index.html'>Computer animation</a>, or here the <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/WordAnimation/Jazz_animation/styles.css'>Jazz source code</a> and the <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/WordAnimation/computer_animation/styles.css'>Computer source code</a>.</p><h2>Lessons learned</h2><p>Since I didn’t know how CSS animations worked before, this was a fun first introduction.</p>"
  },
  {
    "segment": ".project-list",
    "imageSrc": [
      "./images/WijzeWeetjes/1.png",
      "./images/WijzeWeetjes/2.gif",
      "./images/WijzeWeetjes/3.png",
      "./images/WijzeWeetjes/4.png",
      "./images/WijzeWeetjes/5.png"
    ],
    "Description": "Interactive 3D design & development",
    "Title": "Wijze Weetjes",
    "Content": "<div class='tags'><p>Externe klant</p><p>3D</p><p>Interactive</p><p>Thomas More</p></div><div class='techStack'><img src='./images/techStack/spline.jpg' alt='spline'></div> <p>Bekijk de <a href='https://youtu.be/8G7a7iWS2_I'>playthrough</a>!</p><p>Deze opdracht werd gemaakt in samenwerking met de researchgroep van Thomas more en uitgeverij Pelckmans als klant. We kregen de opdracht om de boeken aantrekkelijker te maken voor de doelgroep, op een interactieve manier dat de gebruiker verbindt met de boekenwinkel.</p> <p>Als eerste moesten we de selectie maken van onze Pelckman IP naar keuze. Verschillende mensen kozen voor Wijze Weetjes, een boekenreeks met een sterke visuele stijl, gericht naar een speelse doelgroep van 4-8 jaar. Zo begon ik samen met mijn groep, bestaande uit <a href='https://BrackeDylan.be'>Dylan</a>, <a href='https://eviderudder.pages.dev/'>Evi</a>, <a href='https://timgrevendonk.github.io/portfolio_2024/'>Tim</a> en ik aan onze research naar het project.</p> <h2>Research</h2> <p>Samen met mijn groep hebben we grondig research gedaan, we hebben contact gehad met verschillende mensen van Pelckmans, de doelgroep (kinderen en hun ouders) en mensen die veel met kinderen omgaan zoals leerkrachten van de kleuter- en lagere schoool. Op basis van deze informatie zijn we aan de slag gegaan om een idee te definiëren en uit te schrijven. Hier hebben we veel verschillende brainstorm-tactieken gebruikt. Belangrijk hier was dat we het business-aspect niet uit het oog verloren. Er moest uiteraard ook iets in zitten voor de uitgeverij zelf.</p><p>Na verschillende ideeën te bedenken, hebben we in groep gekozen om een interactieve wereld te ontwikkelen voor kinderen. Wijze Weetjes is het perfecte medium hiervoor met de felle kleuren en unieke vormgeving, die uiteraard ook zeer goed geimplementeerd moest worden. Er werden vervolgens verschillende zaken opgesteld, zoals customer journeys en persona's. Deze maakten het makkelijker om te visualiseren wat de doelgroep zou willen.</p> <h2>Design & Development</h2> <p>Het omzetten van dit idee naar een product, was toch een heel avontuur. We hebben gekozen om Spline te gebruiken voor de ontwikkeling, na het te vergelijken met andere 3d/game-technologieën zoals Unity, Unreal en Roblox. Dit bleek uiteindelijk toch misschien niet ideaal te zijn voor de case die we wouden uitwerken.</p><p>Spline is volgens mij beter gepast voor kleinere cases, met minimale activiteit. Ons project werd snel te complex voor spline, wat het ons later wel moeilijker maakte. Na héél veel (probleemoplossend) te ontwikkelen, hebben we toch een applicatie kunnen maken waar we trots op mogen zijn. Het is een leuk spelletje geworden voor kinderen. Het idee is om hun per level een kleine puzzel te geven, dat het kind moet oplossen om een weetje terug te vinden. Dit kan je zien in de <a href='https://youtu.be/8G7a7iWS2_I'>video</a>.</p><h2>Brief of concept</h2><p>Op basis van het project hebben we een <a href='https://drive.google.com/file/d/19Z2U3SRA3GsIta8NhgAjr7TdVy9YVWoT/view?usp=sharing'>Brief of concept</a> gemaakt die het idee beter uitlegt en alle stappen meer in detail bekijkt.</p><p>De presentatie er van vind je <a href='https://drive.google.com/file/d/1W7sl5_VDf9yX6g-q7IT4VdALMhGsEqy9/view?usp=sharing'>hier</a> terug.</p><h3>Disclaimer</h3><p>\"Wijze Weetjes\" is eigendom van de auteurs: Katrijn De Wit, Inge Rylant, Laura Bergans en Pelckmans Uitgevers nv. In samenwerking met de Thomas More hogeschool gaven Pelckmans en de auteurs ons (studenten van het vak design 5, 2023-2024) de toestemming om een IP te gebruiken in een project.</p>"
  },
  {
    "segment": ".experience-list",
    "imageSrc": [
      "./images/GrowLab/1.png"
    ],
    "Description": "Full-stack development & design",
    "Title": "GrowLab",
    "Content": "<div class='tags'><p>Bachelor thesis</p><p>Web</p><p>Thomas More</p></div><div class='techStack'><img src='./images/techStack/ts.jpg' alt='ts'><img src='./images/techStack/react.jpg' alt='react'><img src='./images/techStack/nest.jpg' alt='nest'><img src='./images/techStack/figma.jpg' alt='figma'><img src='./images/techStack/heroku.png' alt='heroku'></div> <p>Lab 3 is the course that brought together all other courses in the Digital Experience Design program. Here, we were tasked with creating an idea for a digital platform, designing it, developing it, and making it realistically feasible. My teammate <a href='https://marlenebraem1999.github.io/'>Marlène Braem</a> and I chose to create this project with the theme of <b>digital startups</b>.</p> <h2>Ideation</h2> <p>For this project, we first had to come up with an idea in a short time that was interesting enough for both team members and feasible. Therefore, we chose to create an online platform focused on digital startups. We wanted to create an environment that connects startups with each other and with other profiles that can help guide or support the startups. Both of us already had an interest in the startup scene for this project, so we found this a good opportunity to explore it further.</p> <h2>Research</h2> <p>We wrote an extensive <a href='https://drive.google.com/file/d/158z-Z3Q8ssfh9F77mKBirs1LxXeL8O8t/view?usp=sharing'>research report</a> that examines and defines both the target audience and the product's place in the market. This includes looking at market trends, competition, and other possibilities that might exist.</p> <h2>Design</h2> <p>The next step was to name the project, visualize it, and develop cases. For this, we wrote a <a href='https://drive.google.com/file/d/1X8iJHcLW0sZm4NbnRcMYncyxyCs2Oz5u/view?usp=sharing'>design report</a> that addresses and supports all these topics.</p> <p>The prototypes we created can be found <a href='https://www.figma.com/design/AWdQwAROS5XyMiywfxwhIM/GrowLab-High-Fidelity?node-id=0-1&t=RRJiiufmro5cxTEb-1'>here</a>.</p> <h2>Technical</h2> <p>This project was built on a React frontend that communicates with a NestJS backend connected to a MySQL database. For me, it was the first experience with both React and Nest, but since they have both become so popular, they were already on my radar of technologies I wanted to explore.</p> <p>The entire stack of the developed product was hosted on Heroku. This was fairly easy to set up and not too expensive. On a production scale, I would have looked into AWS hosting solutions.</p> <p>Our repositories can be found <a href='https://github.com/orgs/TM-GrowLab/repositories'>here</a>. A <a href='https://drive.google.com/file/d/1X8iJHcLW0sZm4NbnRcMYncyxyCs2Oz5u/view?usp=sharing'>technical report</a> was also written.</p> <h2>Business</h2> <p>In later phases of the project, we found that it was more challenging than initially thought to make this platform profitable and maintainable. After experimenting with many different ideas, we came up with a solution that would work. More about this can be found in our <a href='https://drive.google.com/file/d/1X8iJHcLW0sZm4NbnRcMYncyxyCs2Oz5u/view?usp=sharing'>business report</a>.</p> <h2>Lessons learned</h2> <p>This project was quite an adventure. Sometimes it was difficult to find the common thread again, but I think we ultimately created a beautiful project. I learned a lot in all aspects of the project: design, research, development (React and Nest), and business are all areas where I iterated and improved significantly. Currently, I have a great interest in Nest and TS, partly due to developing this project.</p>"
  },
  {
    "segment": ".event-list",
    "imageSrc": [
      "./images/Events/forward2.jpg",
      "./images/About/PXL_20240425_192726845.jpg",
      "./images/Events/forward3.jpg",
      "./images/Events/forward1.jpg"
    ],
    "Description": "Events",
    "Title": "Forward festival",
    "Content": "<div class='tags'><p>Event</p><p>Design festival</p><p>International</p><p>Thomas More</p></div><p>On April 25 & 26, I attended the Forward Design Festival in Hamburg together with my fellow students from Digital Experience Design. This event was a great opportunity to attend lectures by graphic, UI/UX, font, and other designers from around the world. I met a lot of interesting people who shared valuable insights about their experiences as designers.</p>"
  },
  {
    "segment": ".misc-list",
    "imageSrc": [
      "./images/Portfolio/1.png",
      "./images/Portfolio/2.png",
      "./images/Portfolio/3.png"
    ],
    "Description": "Creative design & development",
    "Title": "Portfolio (Roelant.js)",
    "Content": "<div class='tags'><p>Responsive web</p><p>Thomas More</p></div><div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'><img class='techstack' src='./images/techStack/heroku.png' alt='heroku'></div> <p>This website is my portfolio. Here you can find all my projects and more information about myself. I chose to create my own pseudo-framework based on JS. This means that the content of the projects is automatically and dynamically added to the site using templates.</p> <h2>Design</h2> <p>This is the second iteration of my portfolio because I quickly grew tired of the first one. This version is better designed and a bit more aesthetic.</p> <h2>Technical</h2> <p>As mentioned, this site was created using a simple self-made \"framework.\" This allows me to simply adjust a JSON file with the content I want. The code then adds this content to the projects and creates a project page for it. I also experimented with SEO here because I wanted this portfolio to appear when you search for my name.</p> <p>The site is hosted via Heroku and Cloudflare.</p>"
  },
  {
    "segment": ".project-list",
    "imageSrc": [
      "./images/Wordle/1.png",
      "./images/Wordle/2.png"
    ],
    "Description": "Development",
    "Title": "Wordle Clone",
    "Content": "<div class='tags'><p>Web</p><p>Personal</p></div><div class='techStack'><img src='./images/techStack/angular.png' ><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'><img class='techstack' src='./images/techStack/heroku.png' alt='heroku'></div> <p>To refresh my Angular skills a bit, I decided to create a clone of the web game 'Wordle,' which was extremely popular some time ago.</p><h2>Approach</h2><p>First, I played the original version of Wordle a few times to analyze the exact steps involved. Then, I translated this into flowcharts to have a visual representation. After that, I converted this into an Angular project, as it had been a while since I last worked with Angular. I created appropriate components that build on each other, and all the game logic is handled in a dedicated GameService.</p> <h2>Result</h2><p>You can see how the project was coded in the <a href='https://github.com/jeroen-roelant/wordle_clone'>GitHub repository</a> I created for it.</p><p><a href='https://roelant.dev/wordle'>You can also try it out yourself on my site.</a></p><h2>Lessons learned</h2><p>I mainly learned that Angular is still a very powerful tool and that I can still use it effectively. The game logic was smooth and fun to work out.</p>"
  },
  {
    "segment": ".experience-list",
    "imageSrc": [
      "./images/Stage/HiX_ecosystem.png",
      "./images/Stage/2.png"
    ],
    "Description": "Internship Full-stack development",
    "Title": "Autocomplete matrix",
    "Content": "<div class='tags'><p>Chipsoft</p><p>Bachelor thesis</p><p>AP</p></div><div class='techStack'><img src='./images/techStack/wpf.jpg' ><img src='./images/techStack/csharp.jpg' alt='csharp'></div><p>During my first higher education program (Electronics-ICT), I interned at ChipSoft in Berchem, where I learned a lot by working on HiX and developing an entirely new feature for it. This was done in an in-house .NET framework.</p><p><a href='https://drive.google.com/file/d/1SxnGtw6VDESUCiPW6QIVY3zwNp3ATisv/view?usp=sharing'>Documentation</a></p><h2>Summary of the internship assignment</h2><p>To efficiently monitor patients, it is important that HiX contains large amounts of data about the respective patient. This data is often entered into the system by a healthcare provider or the patient themselves. However, certain data in HiX can be derived from other data. I developed a system to help users derive data based on definitions.</p><p>The goal of this assignment was to develop a system that could automatically fill in data based on already entered information. An IT staff member could define rules for how the data should be processed. For example: A patient is located at location Y because they underwent a specific procedure S, and the specialization of the performing doctor is X. The data is not directly linked in the database structure. Currently, this is resolved in various ways in different scenarios. The aim was to develop a solution that could be used in multiple scenarios.</p><h2>Blueprint</h2><p>First, a thorough analysis was conducted, based on which the blueprint was created. This blueprint served as the foundation for the project. For each part of the project that needed to be developed, the necessary diagrams were created, often in UML. Where necessary, an ERD was also created.</p><h2>Design</h2><p>Of course, I had to adhere to the existing HiX house style. This style is primarily clear and practical.</p><h2>Development</h2><p>With the necessary support from my internship supervisors Anton and Hendrik, I began implementing these blueprints. Development within the .NET framework went smoothly. The project quickly took shape and worked as intended.</p><h2>Lessons learned</h2><p>I learned a tremendous amount during this internship. It was my first experience in software development where I successfully turned a fairly abstract idea into a real product. I am very grateful for this opportunity and the support of my internship supervisors and the entire ChipSoft R&D team.</p>"
  },
  {
    "segment": ".event-list",
    "imageSrc": [
      "./images/Events/htf2.jpeg",
      "./images/Events/htf1.jpeg"
    ],
    "Description": "Events",
    "Title": "Hack the future 2022",
    "Content": "<div class='tags'><p>Hackathon</p><p>AP</p></div><div class='techStack'><img src='./images/techStack/angular.png'></div><p>On November 15, 2022, I participated in Hack The Future, a hackathon organized by the Cronos Group. In teams, we were tasked with coming up with solutions for the problems they presented. It was a very educational experience, and I learned a lot from it. It was also a great opportunity to network with other students and companies.</p><p>Our <a href='https://github.com/Jeroen-Roelant/HackTheFuture2022'>solutions</a> were created in Angular, as it allowed us to work with TypeScript and directly visualize our problems.</p><p>In the end, we placed fourth in our group. The atmosphere (and the free food and drinks) were definitely worth it. 🥳</p>"
  },
  {
    "segment": ".event-list",
    "imageSrc": [
      "./images/Events/valencia3.jpg",
      "./images/Events/Valencia0.jpg",
      "./images/Events/valencia1.jpg",
      "./images/Events/valencia2.jpg"
    ],
    "Description": "Events",
    "Title": "ICT Week Valencia",
    "Content": "<div class='tags'><p>International</p><p>AP</p></div><p>In July 2022, I participated in the ICT Week 2022 in Valencia together with some friends. This was an international event where we had to complete a week-long hackathon in diverse groups, focused on Android apps themed around the city of Valencia. My group and I created an application that displays bars and cafés on a map, along with their cheapest beer.</p><p>Our group ultimately won the hackathon.</p>"
  },
  {
    "segment": ".project-list",
    "imageSrc": [
      "./images/Zeeslag/bs1.png"
    ],
    "Description": "VR Game Development",
    "Title": "Battleship VR",
    "Content": "<div class='tags'><p>Virtual reality</p><p>Machine learning</p><p>AP</p><p>Game development</p></div><div class='techStack'><img src='./images/techStack/unity.png'></div><p>Watch the <a href='https://youtu.be/LT9Stxi-cCE'>video</a> here!</p><h2>Project</h2><p>For my Mixed Reality minor, I worked in a group to create a modern iteration of the board game 'Battleship.' Together with my teammates Bjorn Felix, Evert Bekaert, Ruben Vorsselmans, and Tibe De Clercq, we created a very unique version of the game. We developed the game in Unity and ported it to a VR environment. This was a very educational experience, and we had a lot of fun.</p><p>The game takes place on the bridge of a warship, where you see a 3D version of the enemy's field in front of you. In real time (not turn-based like the original), you can shoot at the enemy's field, and your AI opponent does the same to you. The ships are always placed randomly.</p><h3>Machine learning</h3><p>Your opponent in this game is an ML-Agent, trained to be fairly accurate (but not too accurate).</p><h2>Lessons learned</h2><p>This was a very fun and educational project, where we learned to work with Unity in a group, effectively use ML agents, and develop a project from start to finish. This project was evaluated very highly. We received a 19/20. 🥳</p>"
  }
]