[
    {
        "imageSrc": ["./images/Hoppin/Hoppin1.png", "./images/Hoppin/Hoppin_analysis_1.png", "./images/Hoppin/Hoppin_analysis_2.png", "./images/Hoppin/Hoppin_analysis_3.png"],
        "Description": "App UIUX design",
        "Title": "Hoppin: app redesign",
        "Content": "<div class='techStack'><img src='./images/techStack/figma.jpg' alt='figma'><img src='./images/techStack/useberry.png' alt='useberry'><img src='./images/techStack/lyssna.png' alt='figma'></div><p>Voor deze opdracht kregen we de opgave om de mobiele applicatie van Hoppin, het platform voor het nieuwe vlaamse mobiliteitsplan, te redesignen. Dit met de bedoeling van een applicatie te maken die op een esthetische manier de gebruiker informatie geeft over zijn/haar ritten, tickets, lijnen, ...</p><p>Dit was mijn eerste grote opdracht in Figma, en gaf me dus direct een uitgebreide opdracht om Figma echt onder te knie te krijgen. Andere belangrijke dingen waren onder andere het analyseren van gebruikersnoden en deze omzetten naar user stories; het opvolgen van een designsysteem, standaarden en huisstijl, alsook de CRAP-regels en Nielsen Heuristics.</p><h2>Proces</h2><h3>Analyse</h3><p>De eerste stap was om de noden van de gebruikers te analyseren. Hiervoor hebben we in groep samen gezeten over verschillende sprints, en telkens geïtereerd om van een chaotische mess van <a href='./images/Hoppin/Hoppin_analysis_1.png'>functies</a>, naar <a href='./images/Hoppin/Hoppin_analysis_2.png'>User stories</a>, naar <a href='./images/Hoppin/Hoppin_analysis_3.png'>gestructureerde flowcharts</a> te gaan.</p><h3>Prototype</h3><p>    Na de analysefase was het tijd om een prototype te maken. Vanaf nu was het project individueel. Ook dit gebeurde op een iteratieve wijze. Ik begon met mijn wireframes, waarna ik een low-fidelity prototype maakte. Dit prototype werd dan getest met enkele gebruikers, en op basis van hun feedback werd het prototype aangepast. Dit proces werd herhaald tot ik een high-fidelity prototype had.</p><p>Het high-fidelity prototype werd ook voleldig klikbaar gemaakt, zodat het leek alsof het een echte applicatie was. Dit prototype werd dan ook getest met gebruikers, en op basis van hun feedback werd het prototype aangepast, en grondig getest op fouten.</p><p>Het high-fidelity prototype kan je <a href='https://www.figma.com/proto/qDeByxqVmz1KJjjsNObI4T/%5BJeroen-Roelant%5D-HOPPIN-High-fidelity-prototype?page-id=0%3A1&node-id=46-11571&viewport=442%2C526%2C0.07&t=bGuVHFPIcKRQC0RR-1&scaling=scale-down&starting-point-node-id=46%3A11290&show-proto-sidebar=1'>hier</a> testen. (aanmelden doe je door gewoon op het emailveld en wachtwoordveld te klikken!)</p> <h2>User tests</h2> <p>Om het gemaakte prototype te testen en valideren, werden er ook verschillende testen uitgevoerd op de doelgroep. Dit via een 5 second test, een recognition test en user flow tests. Het verslag hiervan kan je <a href='https://drive.google.com/file/d/1W7sl5_VDf9yX6g-q7IT4VdALMhGsEqy9/view?usp=sharing'>hier</a> lezen.</p><h2>Lessons learned</h2> <p>De belangrijkste lessen die ik heb geleerd uit Hoppin, is hoe ik juist moet omgaan met een designproces. Ik heb geleerd hoe ik moet omgaan met gebruikers, hoe ik moet omgaan met feedback, en hoe ik moet omgaan met een designsysteem.</p> <p>Verder heb ik ook geleerd hoe ik moet omgaan met Figma. Na dit project voelde ik me een echte Figma power-user en klikte alles.</p>"
    },
    {
        "imageSrc": ["./images/ZenGarden/ZenGarden1.jpg", "./images/ZenGarden/Moodboard.jpg", "./images/ZenGarden/ZenGarden_proto_1.jpg", "./images/ZenGarden/ZenGarden_proto_2.jpg"],
        "Description": "Webdesign",
        "Title": "CSS Zen Garden",
        "Content": "<div class='techStack'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/figma.jpg' alt='figma'></div><p>Voor het vak Design 4 kregen we de opdracht zelf de CSS Zen garden opdracht eens aan te pakken. Dit moesten we doen in thema van een architectuurstijl die ons willekeurig werd toegewezen. Ik kreeg als thema Art Nouveau.</p> <p>In het verleden had ik dit al eens gedaan (in het middelbaar), maar deze versie was ook niet super in haar resultaat. Daarom ben ik helemaal opnieuw begonnen om iets te maken dat past bij de stijl, en zeer esthetisch is.</p> <h2>Research & Moodboard</h2><p>Als eerst werd er grondig geresearched naar de historie van de stijl en de belangrijkste en bekendste artiesten, architecten en kunstwerken ervan. Belangrijke dingen die werden genoteerd, waren: Kleuren, stijlkenmerken, typografie, patronen, texturen, architecten, kunst(enaars), ...</p><p>Op basis van deze informatie werd er vervolgens een moodboard opgesteld. Dit is de tweede afbeelding in deze collectie. Dit is de basis waarop ik m'n design ging baseren.</p><h2>Prototype</h2><p>Het eerste wat ik besliste om mee verder op te bouwen, was om de site horizontaal te laten scrollen, in de plaats van verticaal, met een scroll snap. Waarom? dat weet ik niet maar het leek me een leuke manier om mijn ontwerp te laten differentiëren. Met dit idee ben ik dus vertrokken om een low-fidelity prototype te maken dat met elk onderwerp van de Zen Garden content een ander creatief ontwerp of idee probeerde te bereiken (zie <a href='./images/ZenGarden/ZenGarden_proto_1.jpg'>afbeelding 3</a>).</p> <img src='./images/ZenGarden/ZenGarden_proto_1.jpg' alt='low-fidelity prototype'><p>Dit werd later verfijnd tot een high-fidelity prototype, waarin er een keuze werd gemaakt naar kleuren, typografie, afbeeldingen, ... (zie <a href='./images/ZenGarden/ZenGarden_proto_2.jpg'>afbeelding 4</a>).</p> <img src='./images/ZenGarden/ZenGarden_proto_2.jpg' alt='high fidelity prototype'><h2>Code</h2><p>Na het prototype werd de css uitgeschreven. Bekijk hier <a href='https://jeroen-roelant.github.io/Design4/ZenGarden/index.html'>het resultaat</a> en <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/ZenGarden/style.css'>de broncode</a>.</p><h2>Lessons learned</h2> <p>De belangrijkste lessen die ik heb geleerd uit Zen Garden, is uiteraard de werkwijze en hoe ik juist om ga met CSS. Dat is uiteindelijk ook het doel van de opdracht. Ik voel nu van mezelf dat ik beter om kan gaan met CSS, en leukere designs er in kan verwerken.</p>"
    },
    {
        "imageSrc": ["./images/Poster/1.gif", "./images/Poster/moodboard1.jpg", "./images/Poster/schetsen1.jpg"],
        "Description": "Creative CSS design",
        "Title": "Dynamic Movie Poster",
        "Content": "<div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'></div><p>Hier kregen we de opdracht om een dynamische poster te maken, met enkel en alleen één HTML bestand. Alles qua styling en scripting moest dus ook in dit bestand gebeuren, alsook de SVGs die hier in moesten staan. Dit zorgde er voor dat ik heel creatief moest om gaan met de aanpak van dit project.</p>        <p>Het belangrijkste van deze opdracht was vooral dat structureel werken met de HTML, en speciale dingen leren doen met CSS (interacties en animaties).</p>        <p>Ik koos als thema de film Interstellar</p>         <h2>Research & Moodboard</h2>        <p>Veel research moest ik niet echt doen, aangezien Interstellar een van mijn favoriete films is en Christopher Nolan een van mijn favoriete regisseurs. Het doel van de research was dus om een duidelijke visuele stijl te kiezen, alsook een object waarop ik me wou baseren en gebruiken als centraal thema van mijn poster.</p>        <p>Op basis van de research die ik heb gedaan, heb ik vervolgens een <a href='./images/Poster/moodboard1.jpg'>moodboard</a> gemaakt. Dit moodboard omvat de visuele stijl en belangrijke onderdelen van de film die ik mogelijk in mijn poster wou verwerken. </p>           <h2>Ontwerp</h2>        <p>Op basis van het moodboard werden er enkele schetsen gemaakt (zie <a href='./images/Poster/schetsen1.jpg'>Afbeelding 3</a>) uiteindelijk koos ik om ontwerp 1 uit te werken.</p>      <p>Daarom heb ik ervoor gekozen om de Endurance, het ruimteschip uit de film, te gebruiken als centraal thema van mijn poster. Dit ruimteschip is een van de belangrijkste elementen van de film en is ook een heel herkenbaar object. Ik heb ervoor gekozen om de Endurance in de ruimte te plaatsen, met in het groot Gargantua, het zwarte gat, ook in beeld. Deze zijn beide geanimeerd, met het schip dat rond haar eigen as draait, en het zwarte gat dat een frame by frame animatie gebruikt.</p>       <h2>Uitwerking</h2>         <p>Ik heb ervoor gekozen om de poster in verschillende delen op te splitsen, en deze dan te animeren met CSS. Zo heb ik de Endurance en Gargantua in aparte divs geplaatst, en deze dan geanimeerd met CSS. De Endurance draait rond haar eigen as, en Gargantua heeft een frame by frame animatie die het zwarte gat laat draaien.</p>     <p>Voor deze frame by frame animatie heb ik vrij speciale code moeten ontwikkelen. Eerst had ik verschillende SVG's gemaakt, en deze vervolgens allemaal in de html geplaatst. Deze werden vervolgens gepositioneerd over elkaar. Een CSS animatie zorgt er voor dat de frames om de beurt worden getoond.</p>      <p>De sterren op de achtergrond krijgen een automatisch gegenereerde positie en grootte. Deze zijn dus altijd op een andere locatie op het scherm.</p>      <h2>Code</h2>      <p>Zie hier de <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/Poster/index.html'>broncode</a> en het <a href='https://jeroen-roelant.github.io/Design4/Poster/index.html'>resultaat</a>.</p> <h2>Lessons learned</h2> <p>Nog nooit heb ik zo'n creatieve HTML en CSS geschreven. Ik heb voor dit project echt out of the box moeten denken, en op bepaalde manieren te werk moeten gaan dat ik eerder niet heb gedaan.</p>"
    },
    {
        "imageSrc": ["./images/UselessWeb/1.gif", "./images/UselessWeb/2.gif"],
        "Description": "Creative design & development",
        "Title": "Useless web projects",
        "Content": "<div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'></div><p>Hier was de opdracht om enkele nutteloze websites te maken. Ik heb er voor gekozen om een calculator te maken die altijd wel juist antwoord, maar een antwoord geeft waar je niets mee bent. Het tweede dat ik had gemaakt, was een left-on-red simulator die nooit antwoord op je berichtjes.</p><p>Over het algemeen is er niet super veel designproces verwerkt in deze opdrachten, aangezien de ideeën gebaseerd zijn op bestaande interfaces of items. Sommigen van deze projectjes waren deel van een groepswerk.</p><h2>Technically correct calculator</h2><p>Een rekenmachine programmeren blijkt toch moeilijker te zijn dan eerst gedacht. Ik heb hier redelijk wat werk in mogen steken om ervoor te zorgen dat het werkt op de manier dat je zou verwachten van een rekenmachine. Deze heeft alleen een kleine twist, De antwoorden dat je terug krijgt 'kloppen' wel, maar zijn totaal niet nuttig. De antwoorden zullen altijd een groter dan, kleiner dan of ongeveer geven met telkens een bepaalde marge van gerandomiseerde getallen.</p><p>Probeer de <a href='https://jeroen-roelant.github.io/Design4/UselessWeb/Technically_correct_calculator/calculator.html'>Calculator</a> en bekijk hier de <a href='https://github.com/Jeroen-Roelant/Design4/tree/main/UselessWeb/Technically_correct_calculator'>calculator broncode</a>.</p><h2>Left on Read Simulator</h2><p>Voor mijn tweede useless web inzending heb ik een left on read chat simulator gemaakt. Dit is een simpele chatt app clone waar je berichten naar kan sturen, maar die nooit zal antwoorden.</p><p>Probeer de of de <a href='https://jeroen-roelant.github.io/Design4/UselessWeb/LeftOnReadSim/index.html'>Left on read simulator</a> en bekijk hier de <a href='https://github.com/Jeroen-Roelant/Design4/tree/main/UselessWeb/LeftOnReadSim'>left on read simulator broncode</a>.</p><h2>Lessons learned</h2><p>Het was vooral een leuk projectje om mijn css een beetje op te frissen, en ik ben er ook achter gekomen dat een rekenmachine programmeren toch iets complexer is dan je zou verwachten.</p>"
    },
    {
        "imageSrc": ["./images/WordAnimation/1.gif", "./images/WordAnimation/2.gif"],
        "Description": "CSS Design & Animation",
        "Title": "CSS Word Animations",
        "Content": "<div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'></div><p>We kregen enkele willekeurige woorden waarvan we een animatietje moesten maken, met CSS. Dit zijn de resultaten er van!</p> <h2>Jazz</h2> <p>Als fervente jazz-fan, was ik zeer blij dat ik dit woord kreeg. Ik had direct het idee om dit uit te werken. Eerst werden er enkele schetsen gemaakt, die ondertussen helaas verloren zijn geraakt, Ze waren wel een goed startpunt voor verder op te gaan.</p> <p>Tijdens het uitwerken van de animaties, vond ik het eigenlijk maar heel simpel, dus had ik nog enkele andere elementen toegevoegd, zoals een vorm op de achtergrond en enkele muzieknoten alsook een beetje kleur, waarover grondig werd nagedacht, omdat ik wel echte jazz-kleuren wou.</p> <p>Bekijk hier de <a href='https://jeroen-roelant.github.io/Design4/WordAnimation/Jazz_animation/index.html'>Jazz animatie</a> en de <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/WordAnimation/Jazz_animation/styles.css'>Jazz broncode</a>.</p><h2>Computer</h2> <p>De computeranimatie was nog iets simpeler, aangezien het eigenlijk mijn goede vriend Tim zijn idee was, hij kwam met het idee naar voren, maar niemand voor het groepswerk uitwerken. Ik heb het daarom voor mezelf maar gemaakt. </p> <p>Bekijk hier de <a href='https://jeroen-roelant.github.io/Design4/WordAnimation/Jazz_animation/index.html'>Jazz animatie</a> en de <a href='https://jeroen-roelant.github.io/Design4/WordAnimation/computer_animation/index.html'>Computer animatie</a>, of hier de <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/WordAnimation/Jazz_animation/styles.css'>Jazz broncode</a> en de <a href='https://github.com/Jeroen-Roelant/Design4/blob/main/WordAnimation/computer_animation/styles.css'>Computer broncode</a>.</p><h2>Lessons learned</h2><p>Aangezien ik nog niet wist hoe CSS animations werkte, was dit een leuke eerste introductie.</p>"
    },
    {
        "imageSrc": ["./images/WijzeWeetjes/1.png", "./images/WijzeWeetjes/2.gif", "./images/WijzeWeetjes/3.png", "./images/WijzeWeetjes/4.png", "./images/WijzeWeetjes/5.png"],
        "Description": "Interactive 3D design & development",
        "Title": "Wijze Weetjes",
        "Content": "<div class='techStack'><img src='./images/techStack/spline.jpg' alt='spline'></div> <p>Deze opdracht werd gemaakt in samenwerking met de researchgroep van Thomas more en uitgeverij Pelckmans als klant. We kregen de opdracht om de boeken aantrekkelijker te maken voor de doelgroep, op een interactieve manier dat de gebruiker verbindt met de boekenwinkel.</p> <p>Als eerste moesten we de selectie maken van onze Pelckman IP naar keuze. Verschillende mensen kozen voor Wijze Weetjes, een boekenreeks met een sterke visuele stijl, gericht naar een speelse doelgroep van 4-8 jaar. Zo begon ik samen met mijn groep, bestaande uit <a href='https://BrackeDylan.be'>Dylan</a>, <a href='https://www.linkedin.com/in/evelien-de-rudder-a35b4b209/'>Evi</a>, <a href='https://timgrevendonk.github.io/portfolio_2024/'>Tim</a> en ik aan onze research naar het project.</p> <h2>Research</h2> <p>Samen met mijn groep hebben we grondig research gedaan, we hebben contact gehad met verschillende mensen van Pelckmans, de doelgroep (kinderen en hun ouders) en mensen die veel met kinderen omgaan zoals leerkrachten van de kleuter- en lagere schoool. Op basis van deze informatie zijn we aan de slag gegaan om een idee te definiëren en uit te schrijven. Hier hebben we veel verschillende brainstorm-tactieken gebruikt. Belangrijk hier was dat we het business-aspect niet uit het oog verloren. Er moest uiteraard ook iets in zitten voor de uitgeverij zelf.</p><p>Na verschillende ideeën te bedenken, hebben we in groep gekozen om een interactieve wereld te ontwikkelen voor kinderen. Wijze Weetjes is het perfecte medium hiervoor met de felle kleuren en unieke vormgeving, die uiteraard ook zeer goed geimplementeerd moest worden. Er werden vervolgens verschillende zaken opgesteld, zoals customer journeys en persona's. Deze maakten het makkelijker om te visualiseren wat de doelgroep zou willen.</p> <h2>Design & Development</h2> <p>Het omzetten van dit idee naar een product, was toch een heel avontuur. We hebben gekozen om Spline te gebruiken voor de ontwikkeling, na het te vergelijken met andere 3d/game-technologieën zoals Unity, Unreal en Roblox. Dit bleek uiteindelijk toch misschien niet ideaal te zijn voor de case die we wouden uitwerken.</p><p>Spline is volgens mij beter gepast voor kleinere cases, met minimale activiteit. Ons project werd snel te complex voor spline, wat het ons later wel moeilijker maakte. Na héél veel (probleemoplossend) te ontwikkelen, hebben we toch een applicatie kunnen maken waar we trots op mogen zijn. Het is een leuk spelletje geworden voor kinderen. Het idee is om hun per level een kleine puzzel te geven, dat het kind moet oplossen om een weetje terug te vinden. Dit kan je zien in de <a href=''>video</a>.</p><h2>Brief of concept</h2><p>Op basis van het project hebben we een <a href='https://drive.google.com/file/d/19Z2U3SRA3GsIta8NhgAjr7TdVy9YVWoT/view?usp=sharing'>Brief of concept</a> gemaakt die het idee beter uitlegt en alle stappen meer in detail bekijkt.</p><p>De presentatie er van vind je <a href='https://docs.google.com/presentation/d/1gvxKC6tolVS8QGCtzZjvh9HW19FU-CzP/edit?usp=sharing&ouid=115009582328192252597&rtpof=true&sd=true'>hier</a> terug.</p>"
    },
    {
        "imageSrc": ["./images/GrowLab/1.png"],
        "Description": "Full-stack development & design",
        "Title": "GrowLab",
        "Content": "<div class='techStack'><img src='./images/techStack/ts.jpg' alt='ts'><img src='./images/techStack/react.jpg' alt='react'><img src='./images/techStack/nest.jpg' alt='nest'><img src='./images/techStack/figma.jpg' alt='figma'><img src='./images/techStack/heroku.png' alt='heroku'></div> <p>Lab 3 is het vak dat alle andere vakken in de richting Digital Experience Design samen bracht. Hier kregen we de opdracht om een idee te maken voor een digitaal platform, deze te designen, ontwikkelen en realistisch uitvoerbaar maken. Mijn groepslid <a href='https://marlenebraem1999.github.io/'>Marlène Braem</a> en ik kozen er voor om dit project te maken in thema van <b>digitale startups</b>.</p> <h2>Ideation</h2> <p>Voor dit project moesten we eerst en vooral in een korte tijd met een idee op komen dat voor de beide groepsleden interessant genoeg was en haalbaar was. Daarom hebben we gekozen om een online platform te maken dat zich focust op digitale starters. We willen een omgeving maken dat starters onderling connecteert met elkaar, en met andere profielen die kunnen helpen bij het begeleiden of ondersteunen van de startups. We hadden alle twee voor dit project ook wel al interesse in het startup-gebeuren, en vonden dit dus een goede mogelijkheid om er verder op in te gaan.</p> <h2>Research</h2> <p>We hebben een uitgebreid <a href='https://drive.google.com/file/d/158z-Z3Q8ssfh9F77mKBirs1LxXeL8O8t/view?usp=sharing'>researchverslag</a> geschreven dat zowel de doelgroep als de plaats van het product in de markt onderzoekt en definieert. Hierin kijken we naar trends in de markt, competitie en andere mogelijkheden die zouden bestaan.</p> <h2>Design</h2> <p>De volgende stap was om het project een naam te geven, te visualiseren en cases uit te werken. Hiervoor hebben we een <a href='https://drive.google.com/file/d/1X8iJHcLW0sZm4NbnRcMYncyxyCs2Oz5u/view?usp=sharing'>designverslag</a> geschreven dat al deze onderwerpen aan pakt en ondersteunt.</p> <p>De prototypes die we hebben gemaakt kan je <a href='https://www.figma.com/design/AWdQwAROS5XyMiywfxwhIM/GrowLab-High-Fidelity?node-id=0-1&t=RRJiiufmro5cxTEb-1'>hier</a> terug vinden.</p> <h2>Technisch</h2> <p>Dit project werd gebouwd op een React frontend dat communiceert naar een NestJS backend die verbonden is met een MySQL database. Voor mij was het de eerste ervaring met zowel React als Nest, maar aangezien ze alle twee zo groot zijn geworden, stonden ze al lang op mijn radar van technologieën die ik wou ontdekken.</p> <p>De volledige stack van het uitgewerkte product heb ik gehost op Heroku. Dit was vrij gemakkelijk om op te stellen en was niet te duur. Op een productieschaal had ik wel gekeken naar AWS hosting-solutions.</p> <p>Onze repositories zijn <a href='https://github.com/orgs/TM-GrowLab/repositories'>hier</a> terug te vinden. Ook werd er weer een <a href='https://drive.google.com/file/d/1X8iJHcLW0sZm4NbnRcMYncyxyCs2Oz5u/view?usp=sharing'>technisch verslag</a> op gesteld.</p> <h2>Business</h2> <p>In latere fasen van het project hebben we ondervonden dat het moeilijker was dan initieel gedacht om dit platform rendabel en onderhoudbaar te maken. Na heel veel met verschillende ideeën te experimenteren, zijn we gekomen tot een oplossing die wel zou werken. Meer er van vind je terug in ons <a href='https://drive.google.com/file/d/1X8iJHcLW0sZm4NbnRcMYncyxyCs2Oz5u/view?usp=sharing'>businessverslag</a>.</p> <h2>Lessons learned</h2> <p>Dit project was een heel avontuur. Soms was het wel moeilijk om de rode draad terug te vinden, maar ik vind dat we uiteindelijk een mooi project hebben gemaakt. Ik heb enorm veel bijgeleerd op alle vlakken van het project: design, research, ontwikkeling (React en Nest) & business zijn allemaal vlakken waarop ik sterk heb geïtereerd en verbeterd. Momenteel heb ik enorme interesse in Nest en TS, deels wegens het ontwikkelen van dit project.</p>"
    },
    {
        "imageSrc": ["./images/Events/forward2.jpg", "./images/About/PXL_20240425_192726845.jpg", "./images/Events/forward3.jpg", "./images/Events/forward1.jpg"],
        "Description": "Events",
        "Title": "Forward festival",
        "Content": "<p>25 & 26 April ben ik samen met mijn medenstudenten van Digital Experience Design naar het Forward Design Festival gegaan in Hamburg. Dit evenement was een goede mogelijkheid om lezingen te volgen van grafische, UIUX, font, etc. designers van over de hele wereld. Ik heb er een hele boel interessante mensen leren kennen die me veel wisten te zeggen over hun ervaringen als designer.</p>"
    },
    {
        "imageSrc": ["./images/Portfolio/1.png", "./images/Portfolio/2.png", "./images/Portfolio/3.png"],
        "Description": "Creative design & development",
        "Title": "Portfolio (Roelant.js)",
        "Content": "<div class='techStack'><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'><img class='techstack' src='./images/techStack/heroku.png' alt='heroku'></div> <p>Deze website is mijn portfolio. Hierin kan je al mijn projecten terugvinden, en meer informatie over mijzelf. Ik heb gekozen om mijn eigen psuedo-framework te maken op basis van JS. Dit houdt in dat de content van de projecten automatisch, dynamisch wordt toegevoegd aan de site aan de hand van templates.</p> <h2>Design</h2> <p>Dit is de tweede iteratie van mijn portfolio, omdat ik de eerste vrij snel beu was gezien. Deze versie is iets beter ontworpen en een beetje esthetischer.</p> <h2>Technisch</h2> <p>Zoals gezegd, werd deze site gemaakt in een simpel zelfgemaakt \"framework\". Dit staat me toe om gewoon een JSON bestand aan te passen met de content die ik wil. Deze wordt dan door de code toegevoegd aan de projecten, en er wordt een projectpagina voor gemaakt. Ook heb ik hier wat geëxperimenteerd met SEO, omdat ik uiteraard wou dat deze portfolio toont als je mijn naam zoekt.</p> <p>De hosting van de site gebeurt via Heroku en Cloudflare.</p>"
    },
    {
        "imageSrc": ["./images/Wordle/1.png", "./images/Wordle/2.png"],
        "Description": "Development",
        "Title": "Wordle Clone",
        "Content": "<div class='techStack'><img src='./images/techStack/angular.png' ><img src='./images/techStack/html.jpg' alt='html'><img src='./images/techStack/css.jpg' alt='css'><img src='./images/techStack/js.jpg' alt='js'><img class='techstack' src='./images/techStack/heroku.png' alt='heroku'></div> <p>Om mijn angular skills een beetje op te frissen, heb ik besloten om een clone te maken van de web-game 'Wordle' die een tijdje geleden razend populair was.</p><h2>Aanpak</h2><p>Ik heb eerst enkele keren op de orginele versie van wordle gespeeld, om te analyseren welke stappen er juist allemaal gebeuren. Daarna heb ik dit omgezet tot flowcharts, om een visuele vertaling er van te hebben. Daarna heb ik dit vertaald naar een angular project, aangezien het al even geleden was dat ik nog met angular heb gewerkt. Ik heb gepaste componenten gemaakt die op elkaar verder bouwen, en alle game logica gebeurt in een gepaste GameService.</p> <h2>Resultaat</h2><p>Hoe het project juist werd gecodeerd, kan je zien in de <a href='https://github.com/jeroen-roelant/wordle_clone'>GitHub repo</a> die ik er voor heb gemaakt.</p><p><a href='https://jeroenroelant.tech/wordle'>Je kan het ook zelf uitproberen op mijn site.</a></p><h2>Lessons learned</h2><p>Ik heb vooral geleerd dat angular nog steeds een heel krachtige tool is, en dat ik het nog steeds kan gebruiken. De logica van de game, verliep vlot en was leuk om uit te werken.</p>"
    },
    {
        "imageSrc": ["./images/Stage/HiX_ecosystem.png", "./images/Stage/2.png"],
        "Description": "Stage Full-stack development",
        "Title": "Matrix automatisch aanvullen",
        "Content": "<div class='techStack'><img src='./images/techStack/wpf.png' ><img src='./images/techStack/csharp.jpg' alt='csharp'></div><p>Tijdens mijn eerste hogere opleiding (Elektronica-ICT) heb ik stage gelopen bij ChipSoft te Berchem, waar ik zeer veel heb bijgeleerd door mee aan HiX te werken, en zelf een heel nieuwe feature ervoor te ontwikkelen. Dit was toen in een in-house .NET framework.</p><p><a href='https://drive.google.com/file/d/1SxnGtw6VDESUCiPW6QIVY3zwNp3ATisv/view?usp=sharing'>Documentatie</a></p><h2>Samenvatting stageopdracht</h2><p>Om patiënten efficiënt op te volgen is het belangrijk dat HiX grote hoeveelheden data bevat van de desbetreffende patiënt. Deze wordt aak door een zorgverlener of de patiënt zelf ingevoerd in het systeem. Bepaalde data in HiX kan echter worden afgeleid uit andere data. Ik zal een systeem ontwikkelen dat de gebruikers helpt met het afleiden van data op basis van definities. </p><p>Het doel van deze opdracht is dat er een systeem wordt ontwikkeld waarmee automatisch data ingevuld kan worden, gebaseerd op reeds ingevoerde informatie. Een IT-Medewerker zou zelf regels kunnen opstellen van wat er met de data gebeurt. Een voorbeeld hiervan is als volgend: Een patiënt ligt op locatie Y omdat hij een specifieke ingreep S heeft laten doen en de specialisatie van de uitvoerende arts X is. De data zijn dus niet rechtstreeks verbonden in de database structuur. Momenteel wordt dit op verschillende manieren opgelost in diverse scenario’s. Het is dus de bedoeling dat ik een oplossing ontwikkel die gebruikt kan worden in meerdere scenario’s.</p><h2>Blueprint</h2><p>Eerst werd er een grondige analyse gemaakt, op basis waarvan de blueprint werd opgesteld. Deze blueprint was het fundament voor het project te maken. Voor elk onderdeel van het project dat ontwikkeld moest worden, werden de nodige schema's uitgewerkt, vaak in UML. Waar nodig werd er ook een ERD gemaakt.</p><h2>Design</h2><p>Uiteraard moest ik hier de bestaande huisstijl van HiX hanteren. Deze stijl is vooral duidelijk en praktisch.</p><h2>Ontwikkeling</h2><p>Met de nodige ondersteuning van mijn stagebegeleiders Anton en Hendrik, begon ik aan de uitwerking van deze blueprints. Ontwikkeling binnen het .NET framework verliep vlot. Het project kreeg snel vorm en werkte.</p><h2>Lessons learned</h2><p>Ik heb enorm veel geleerd tijdens deze stage. Het was een eerste ervaring in de softwareontwikkeling waarin ik een vrij abstract idee succesvol heb kunnen uitwerken naar een echt product. Ik ben enorm dankbaar voor deze mogelijkheid en de ondersteuning van mijn stagebegeleiders en het hele ChipSoft R&D team.</p>"
    },
    {
        "imageSrc": ["./images/Events/htf2.jpeg", "./images/Events/htf1.jpeg"],
        "Description": "Events",
        "Title": "Hack the future 2022",
        "Content": "<p>15 November 2022 had ik meegedaan aan Hack The Future, een hackathon georganiseerd door de Cronos groep. In groep kregen we de opdracht om oplossingen te bedenken voor problemen die ze gaven. Het was een zeer leerrijke ervaring, en ik heb er veel van opgestoken. Het was ook een goede mogelijkheid om te netwerken met andere studenten en bedrijven.</p><p>Onze <a href='https://github.com/Jeroen-Roelant/HackTheFuture2022'>oplossingen</a> werden gemaakt in Angular, omdat we dan konden werken met TypeScript en direct een visualisatie konden maken van onze problemen.</p><p>Uiteindelijk werden we vierde van onze groep. De sfeer (en het gratis eten en drank) waren toch zeker de moeite. 🥳</p>"
    },
    {
        "imageSrc": ["./images/Events/valencia3.jpg", "./images/Events/Valencia0.jpg", "./images/Events/valencia1.jpg", "./images/Events/valencia2.jpg"],
        "Description": "Events",
        "Title": "ICT-week Valencia",
        "Content":"<p>In juli 2022 heb ik samen met enkele vrienden mee gedaan aan de ICT-week 2022, in Valencia. Dit was een internationaal evenement, waar we in diverse groepjes een soort van een week lange hackathon moesten afleggen voor Android apps in het thema van de stad Valencia. Mijn groep en ik hebben een applicatie gemaakt die bar's en café's toont op een kaart, en terwijl ook hun goedkoopste bier toont.</p><p>Ons groepje heeft uiteindelijk de hackathon gewonnen.</p>"
    }
]